Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_RSTCTL0.h
#define RSTCTL0_DOMRSTSTAT_COMP_STAT_MASK        (0x8U)
#define RSTCTL0_DOMRSTSTAT_COMP_STAT_SHIFT       (3U)
/*! COMP_STAT - VDD2_COMP Domain Reset State
 *  0b0..The domain is in reset state.
 *  0b1..The domain is in normal run state.
 */
#define RSTCTL0_DOMRSTSTAT_COMP_STAT(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL0_DOMRSTSTAT_COMP_STAT_SHIFT)) & RSTCTL0_DOMRSTSTAT_COMP_STAT_MASK)

#define RSTCTL0_DOMRSTSTAT_DSP_STAT_MASK         (0x10U)
#define RSTCTL0_DOMRSTSTAT_DSP_STAT_SHIFT        (4U)
/*! DSP_STAT - VDD2_DSP Domain Reset State
 *  0b0..The domain is in reset state.
 *  0b1..The domain is in normal run state.
 */
#define RSTCTL0_DOMRSTSTAT_DSP_STAT(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTL0_DOMRSTSTAT_DSP_STAT_SHIFT)) & RSTCTL0_DOMRSTSTAT_DSP_STAT_MASK)

#define RSTCTL0_DOMRSTSTAT_MEDIA_STAT_MASK       (0x20U)
#define RSTCTL0_DOMRSTSTAT_MEDIA_STAT_SHIFT      (5U)
/*! MEDIA_STAT - VDD2_MEDIA Domain Reset State
 *  0b0..The domain is in reset state.
 *  0b1..The domain is in normal run state.
 */
#define RSTCTL0_DOMRSTSTAT_MEDIA_STAT(x)         (((uint32_t)(((uint32_t)(x)) << RSTCTL0_DOMRSTSTAT_MEDIA_STAT_SHIFT)) & RSTCTL0_DOMRSTSTAT_MEDIA_STAT_MASK)
/*! @} */

/*! @name PRSTCTL0 - Common Domain Peripheral Reset Control 0 */
/*! @{ */

#define RSTCTL0_PRSTCTL0_IOPCTL0_MASK            (0x40U)
#define RSTCTL0_PRSTCTL0_IOPCTL0_SHIFT           (6U)
/*! IOPCTL0 - IOPCTL0 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL0_IOPCTL0(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL0_IOPCTL0_SHIFT)) & RSTCTL0_PRSTCTL0_IOPCTL0_MASK)
/*! @} */

/*! @name PRSTCTL1 - Compute Domain Peripheral Reset Control 1 */
/*! @{ */

#define RSTCTL0_PRSTCTL1_ELS_MASK                (0x1U)
#define RSTCTL0_PRSTCTL1_ELS_SHIFT               (0U)
/*! ELS - ELS Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL1_ELS(x)                  (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL1_ELS_SHIFT)) & RSTCTL0_PRSTCTL1_ELS_MASK)
/*! @} */

/*! @name PRSTCTL2 - Compute Domain Peripheral Reset Control 2 */
/*! @{ */

#define RSTCTL0_PRSTCTL2_EDMA0_MASK              (0x20U)
#define RSTCTL0_PRSTCTL2_EDMA0_SHIFT             (5U)
/*! eDMA0 - eDMA0 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL2_EDMA0(x)                (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_EDMA0_SHIFT)) & RSTCTL0_PRSTCTL2_EDMA0_MASK)

#define RSTCTL0_PRSTCTL2_EDMA1_MASK              (0x40U)
#define RSTCTL0_PRSTCTL2_EDMA1_SHIFT             (6U)
/*! eDMA1 - eDMA1 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL2_EDMA1(x)                (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_EDMA1_SHIFT)) & RSTCTL0_PRSTCTL2_EDMA1_MASK)

#define RSTCTL0_PRSTCTL2_PKC_MASK                (0x100U)
#define RSTCTL0_PRSTCTL2_PKC_SHIFT               (8U)
/*! PKC - PKC Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL2_PKC(x)                  (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_PKC_SHIFT)) & RSTCTL0_PRSTCTL2_PKC_MASK)

#define RSTCTL0_PRSTCTL2_XSPI0_MASK              (0x400U)
#define RSTCTL0_PRSTCTL2_XSPI0_SHIFT             (10U)
/*! XSPI0 - XSPI0 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL2_XSPI0(x)                (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_XSPI0_SHIFT)) & RSTCTL0_PRSTCTL2_XSPI0_MASK)

#define RSTCTL0_PRSTCTL2_XSPI1_MASK              (0x800U)
#define RSTCTL0_PRSTCTL2_XSPI1_SHIFT             (11U)
/*! XSPI1 - XSPI1 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL2_XSPI1(x)                (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_XSPI1_SHIFT)) & RSTCTL0_PRSTCTL2_XSPI1_MASK)

#define RSTCTL0_PRSTCTL2_GPIO0_MASK              (0x40000U)
#define RSTCTL0_PRSTCTL2_GPIO0_SHIFT             (18U)
/*! GPIO0 - GPIO0 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL2_GPIO0(x)                (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_GPIO0_SHIFT)) & RSTCTL0_PRSTCTL2_GPIO0_MASK)

#define RSTCTL0_PRSTCTL2_GPIO1_MASK              (0x80000U)
#define RSTCTL0_PRSTCTL2_GPIO1_SHIFT             (19U)
/*! GPIO1 - GPIO1 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL2_GPIO1(x)                (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_GPIO1_SHIFT)) & RSTCTL0_PRSTCTL2_GPIO1_MASK)

#define RSTCTL0_PRSTCTL2_GPIO2_MASK              (0x100000U)
#define RSTCTL0_PRSTCTL2_GPIO2_SHIFT             (20U)
/*! GPIO2 - GPIO2 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL2_GPIO2(x)                (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_GPIO2_SHIFT)) & RSTCTL0_PRSTCTL2_GPIO2_MASK)

#define RSTCTL0_PRSTCTL2_GPIO3_MASK              (0x200000U)
#define RSTCTL0_PRSTCTL2_GPIO3_SHIFT             (21U)
/*! GPIO3 - GPIO3 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL2_GPIO3(x)                (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_GPIO3_SHIFT)) & RSTCTL0_PRSTCTL2_GPIO3_MASK)

#define RSTCTL0_PRSTCTL2_GPIO4_MASK              (0x400000U)
#define RSTCTL0_PRSTCTL2_GPIO4_SHIFT             (22U)
/*! GPIO4 - GPIO4 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL2_GPIO4(x)                (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_GPIO4_SHIFT)) & RSTCTL0_PRSTCTL2_GPIO4_MASK)

#define RSTCTL0_PRSTCTL2_GPIO5_MASK              (0x800000U)
#define RSTCTL0_PRSTCTL2_GPIO5_SHIFT             (23U)
/*! GPIO5 - GPIO5 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL2_GPIO5(x)                (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_GPIO5_SHIFT)) & RSTCTL0_PRSTCTL2_GPIO5_MASK)

#define RSTCTL0_PRSTCTL2_GPIO6_MASK              (0x1000000U)
#define RSTCTL0_PRSTCTL2_GPIO6_SHIFT             (24U)
/*! GPIO6 - GPIO6 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL2_GPIO6(x)                (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_GPIO6_SHIFT)) & RSTCTL0_PRSTCTL2_GPIO6_MASK)

#define RSTCTL0_PRSTCTL2_GPIO7_MASK              (0x2000000U)
#define RSTCTL0_PRSTCTL2_GPIO7_SHIFT             (25U)
/*! GPIO7 - GPIO7 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL2_GPIO7(x)                (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_GPIO7_SHIFT)) & RSTCTL0_PRSTCTL2_GPIO7_MASK)

#define RSTCTL0_PRSTCTL2_SCT0_MASK               (0x4000000U)
#define RSTCTL0_PRSTCTL2_SCT0_SHIFT              (26U)
/*! SCT0 - SCT0 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL2_SCT0(x)                 (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_SCT0_SHIFT)) & RSTCTL0_PRSTCTL2_SCT0_MASK)

#define RSTCTL0_PRSTCTL2_LP_FLEXCOMM0_MASK       (0x40000000U)
#define RSTCTL0_PRSTCTL2_LP_FLEXCOMM0_SHIFT      (30U)
/*! LP_FLEXCOMM0 - LP_FLEXCOMM0 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL2_LP_FLEXCOMM0(x)         (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_LP_FLEXCOMM0_SHIFT)) & RSTCTL0_PRSTCTL2_LP_FLEXCOMM0_MASK)

