Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_RSTCTL0.h
#define RSTCTL0_PRSTCTL3_SET_CTIMER4_MASK        (0x2000000U)
#define RSTCTL0_PRSTCTL3_SET_CTIMER4_SHIFT       (25U)
/*! CTIMER4 - CTIMER4 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL3_SET_CTIMER4(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_SET_CTIMER4_SHIFT)) & RSTCTL0_PRSTCTL3_SET_CTIMER4_MASK)

#define RSTCTL0_PRSTCTL3_SET_MRT0_MASK           (0x4000000U)
#define RSTCTL0_PRSTCTL3_SET_MRT0_SHIFT          (26U)
/*! MRT0 - MRT0 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL3_SET_MRT0(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_SET_MRT0_SHIFT)) & RSTCTL0_PRSTCTL3_SET_MRT0_MASK)

#define RSTCTL0_PRSTCTL3_SET_UTICK0_MASK         (0x8000000U)
#define RSTCTL0_PRSTCTL3_SET_UTICK0_SHIFT        (27U)
/*! UTICK0 - UTICK0 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL3_SET_UTICK0(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_SET_UTICK0_SHIFT)) & RSTCTL0_PRSTCTL3_SET_UTICK0_MASK)

#define RSTCTL0_PRSTCTL3_SET_SEMA42_4_MASK       (0x40000000U)
#define RSTCTL0_PRSTCTL3_SET_SEMA42_4_SHIFT      (30U)
/*! SEMA42_4 - SEMA42_4 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL3_SET_SEMA42_4(x)         (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_SET_SEMA42_4_SHIFT)) & RSTCTL0_PRSTCTL3_SET_SEMA42_4_MASK)

#define RSTCTL0_PRSTCTL3_SET_MU4_MASK            (0x80000000U)
#define RSTCTL0_PRSTCTL3_SET_MU4_SHIFT           (31U)
/*! MU4 - MU4 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL3_SET_MU4(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_SET_MU4_SHIFT)) & RSTCTL0_PRSTCTL3_SET_MU4_MASK)
/*! @} */

/*! @name PRSTCTL4_SET - Compute Domain Peripheral Reset Control 4 SET */
/*! @{ */

#define RSTCTL0_PRSTCTL4_SET_CMX_PERFMON2_MASK   (0x1U)
#define RSTCTL0_PRSTCTL4_SET_CMX_PERFMON2_SHIFT  (0U)
/*! CMX_PERFMON2 - CMX_PERFMON2 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL4_SET_CMX_PERFMON2(x)     (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL4_SET_CMX_PERFMON2_SHIFT)) & RSTCTL0_PRSTCTL4_SET_CMX_PERFMON2_MASK)

#define RSTCTL0_PRSTCTL4_SET_CMX_PERFMON3_MASK   (0x2U)
#define RSTCTL0_PRSTCTL4_SET_CMX_PERFMON3_SHIFT  (1U)
/*! CMX_PERFMON3 - CMX_PERFMON3 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL4_SET_CMX_PERFMON3(x)     (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL4_SET_CMX_PERFMON3_SHIFT)) & RSTCTL0_PRSTCTL4_SET_CMX_PERFMON3_MASK)

#define RSTCTL0_PRSTCTL4_SET_SAFO_SGI_MASK       (0x4U)
#define RSTCTL0_PRSTCTL4_SET_SAFO_SGI_SHIFT      (2U)
/*! SAFO_SGI - SAFO_SGI Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL4_SET_SAFO_SGI(x)         (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL4_SET_SAFO_SGI_SHIFT)) & RSTCTL0_PRSTCTL4_SET_SAFO_SGI_MASK)

#define RSTCTL0_PRSTCTL4_SET_PINT0_MASK          (0x20U)
#define RSTCTL0_PRSTCTL4_SET_PINT0_SHIFT         (5U)
/*! PINT0 - PINT0 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL4_SET_PINT0(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL4_SET_PINT0_SHIFT)) & RSTCTL0_PRSTCTL4_SET_PINT0_MASK)

#define RSTCTL0_PRSTCTL4_SET_INPUTMUX0_MASK      (0x80U)
#define RSTCTL0_PRSTCTL4_SET_INPUTMUX0_SHIFT     (7U)
/*! INPUTMUX0 - INPUTMUX0 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL4_SET_INPUTMUX0(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL4_SET_INPUTMUX0_SHIFT)) & RSTCTL0_PRSTCTL4_SET_INPUTMUX0_MASK)

#define RSTCTL0_PRSTCTL4_SET_FREQME0_MASK        (0x100U)
#define RSTCTL0_PRSTCTL4_SET_FREQME0_SHIFT       (8U)
/*! FREQME0 - FREQME0 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL4_SET_FREQME0(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL4_SET_FREQME0_SHIFT)) & RSTCTL0_PRSTCTL4_SET_FREQME0_MASK)

#define RSTCTL0_PRSTCTL4_SET_CMX_PERFMON0_MASK   (0x400U)
#define RSTCTL0_PRSTCTL4_SET_CMX_PERFMON0_SHIFT  (10U)
/*! CMX_PERFMON0 - CMX_PERFMON0 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL4_SET_CMX_PERFMON0(x)     (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL4_SET_CMX_PERFMON0_SHIFT)) & RSTCTL0_PRSTCTL4_SET_CMX_PERFMON0_MASK)

#define RSTCTL0_PRSTCTL4_SET_CMX_PERFMON1_MASK   (0x800U)
#define RSTCTL0_PRSTCTL4_SET_CMX_PERFMON1_SHIFT  (11U)
/*! CMX_PERFMON1 - CMX_PERFMON1 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL4_SET_CMX_PERFMON1(x)     (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL4_SET_CMX_PERFMON1_SHIFT)) & RSTCTL0_PRSTCTL4_SET_CMX_PERFMON1_MASK)

#define RSTCTL0_PRSTCTL4_SET_NPU0_MASK           (0x1000U)
#define RSTCTL0_PRSTCTL4_SET_NPU0_SHIFT          (12U)
/*! NPU0 - NPU0 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL4_SET_NPU0(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL4_SET_NPU0_SHIFT)) & RSTCTL0_PRSTCTL4_SET_NPU0_MASK)
/*! @} */

/*! @name PRSTCTL5_SET - DSP Domain Peripheral Reset Control 5 SET */
/*! @{ */

#define RSTCTL0_PRSTCTL5_SET_HIFI4_MASK          (0x1U)
#define RSTCTL0_PRSTCTL5_SET_HIFI4_SHIFT         (0U)
/*! HiFi4 - HiFi4 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL5_SET_HIFI4(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL5_SET_HIFI4_SHIFT)) & RSTCTL0_PRSTCTL5_SET_HIFI4_MASK)

#define RSTCTL0_PRSTCTL5_SET_HIFI4_DEBUG_MASK    (0x4U)
#define RSTCTL0_PRSTCTL5_SET_HIFI4_DEBUG_SHIFT   (2U)
/*! HiFi4_DEBUG - HiFi4 Debug Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL0_PRSTCTL5_SET_HIFI4_DEBUG(x)      (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL5_SET_HIFI4_DEBUG_SHIFT)) & RSTCTL0_PRSTCTL5_SET_HIFI4_DEBUG_MASK)
/*! @} */

/*! @name PRSTCTL0_CLR - Common Domain Peripheral Reset Control 0 CLR */
/*! @{ */

#define RSTCTL0_PRSTCTL0_CLR_IOPCTL0_MASK        (0x40U)
#define RSTCTL0_PRSTCTL0_CLR_IOPCTL0_SHIFT       (6U)
/*! IOPCTL0 - IOPCTL0 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL0_CLR_IOPCTL0(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL0_CLR_IOPCTL0_SHIFT)) & RSTCTL0_PRSTCTL0_CLR_IOPCTL0_MASK)
/*! @} */

/*! @name PRSTCTL1_CLR - Compute Domain Peripheral Reset Control 1 CLR */
/*! @{ */

#define RSTCTL0_PRSTCTL1_CLR_ELS_MASK            (0x1U)
#define RSTCTL0_PRSTCTL1_CLR_ELS_SHIFT           (0U)
/*! ELS - ELS Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL1_CLR_ELS(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL1_CLR_ELS_SHIFT)) & RSTCTL0_PRSTCTL1_CLR_ELS_MASK)
/*! @} */

/*! @name PRSTCTL2_CLR - Compute Domain Peripheral Reset Control 2 CLR */
/*! @{ */

