Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_RSTCTL0.h
#define RSTCTL0_PRSTCTL2_CLR_EDMA0_MASK          (0x20U)
#define RSTCTL0_PRSTCTL2_CLR_EDMA0_SHIFT         (5U)
/*! eDMA0 - eDMA0 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL2_CLR_EDMA0(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_CLR_EDMA0_SHIFT)) & RSTCTL0_PRSTCTL2_CLR_EDMA0_MASK)

#define RSTCTL0_PRSTCTL2_CLR_EDMA1_MASK          (0x40U)
#define RSTCTL0_PRSTCTL2_CLR_EDMA1_SHIFT         (6U)
/*! eDMA1 - eDMA1 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL2_CLR_EDMA1(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_CLR_EDMA1_SHIFT)) & RSTCTL0_PRSTCTL2_CLR_EDMA1_MASK)

#define RSTCTL0_PRSTCTL2_CLR_PKC_MASK            (0x100U)
#define RSTCTL0_PRSTCTL2_CLR_PKC_SHIFT           (8U)
/*! PKC - PKC Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL2_CLR_PKC(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_CLR_PKC_SHIFT)) & RSTCTL0_PRSTCTL2_CLR_PKC_MASK)

#define RSTCTL0_PRSTCTL2_CLR_XSPI0_MASK          (0x400U)
#define RSTCTL0_PRSTCTL2_CLR_XSPI0_SHIFT         (10U)
/*! XSPI0 - XSPI0 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL2_CLR_XSPI0(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_CLR_XSPI0_SHIFT)) & RSTCTL0_PRSTCTL2_CLR_XSPI0_MASK)

#define RSTCTL0_PRSTCTL2_CLR_XSPI1_MASK          (0x800U)
#define RSTCTL0_PRSTCTL2_CLR_XSPI1_SHIFT         (11U)
/*! XSPI1 - XSPI1 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL2_CLR_XSPI1(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_CLR_XSPI1_SHIFT)) & RSTCTL0_PRSTCTL2_CLR_XSPI1_MASK)

#define RSTCTL0_PRSTCTL2_CLR_GPIO0_MASK          (0x40000U)
#define RSTCTL0_PRSTCTL2_CLR_GPIO0_SHIFT         (18U)
/*! GPIO0 - GPIO0 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL2_CLR_GPIO0(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_CLR_GPIO0_SHIFT)) & RSTCTL0_PRSTCTL2_CLR_GPIO0_MASK)

#define RSTCTL0_PRSTCTL2_CLR_GPIO1_MASK          (0x80000U)
#define RSTCTL0_PRSTCTL2_CLR_GPIO1_SHIFT         (19U)
/*! GPIO1 - GPIO1 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL2_CLR_GPIO1(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_CLR_GPIO1_SHIFT)) & RSTCTL0_PRSTCTL2_CLR_GPIO1_MASK)

#define RSTCTL0_PRSTCTL2_CLR_GPIO2_MASK          (0x100000U)
#define RSTCTL0_PRSTCTL2_CLR_GPIO2_SHIFT         (20U)
/*! GPIO2 - GPIO2 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL2_CLR_GPIO2(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_CLR_GPIO2_SHIFT)) & RSTCTL0_PRSTCTL2_CLR_GPIO2_MASK)

#define RSTCTL0_PRSTCTL2_CLR_GPIO3_MASK          (0x200000U)
#define RSTCTL0_PRSTCTL2_CLR_GPIO3_SHIFT         (21U)
/*! GPIO3 - GPIO3 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL2_CLR_GPIO3(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_CLR_GPIO3_SHIFT)) & RSTCTL0_PRSTCTL2_CLR_GPIO3_MASK)

#define RSTCTL0_PRSTCTL2_CLR_GPIO4_MASK          (0x400000U)
#define RSTCTL0_PRSTCTL2_CLR_GPIO4_SHIFT         (22U)
/*! GPIO4 - GPIO4 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL2_CLR_GPIO4(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_CLR_GPIO4_SHIFT)) & RSTCTL0_PRSTCTL2_CLR_GPIO4_MASK)

#define RSTCTL0_PRSTCTL2_CLR_GPIO5_MASK          (0x800000U)
#define RSTCTL0_PRSTCTL2_CLR_GPIO5_SHIFT         (23U)
/*! GPIO5 - GPIO5 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL2_CLR_GPIO5(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_CLR_GPIO5_SHIFT)) & RSTCTL0_PRSTCTL2_CLR_GPIO5_MASK)

#define RSTCTL0_PRSTCTL2_CLR_GPIO6_MASK          (0x1000000U)
#define RSTCTL0_PRSTCTL2_CLR_GPIO6_SHIFT         (24U)
/*! GPIO6 - GPIO6 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL2_CLR_GPIO6(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_CLR_GPIO6_SHIFT)) & RSTCTL0_PRSTCTL2_CLR_GPIO6_MASK)

#define RSTCTL0_PRSTCTL2_CLR_GPIO7_MASK          (0x2000000U)
#define RSTCTL0_PRSTCTL2_CLR_GPIO7_SHIFT         (25U)
/*! GPIO7 - GPIO7 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL2_CLR_GPIO7(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_CLR_GPIO7_SHIFT)) & RSTCTL0_PRSTCTL2_CLR_GPIO7_MASK)

#define RSTCTL0_PRSTCTL2_CLR_SCT0_MASK           (0x4000000U)
#define RSTCTL0_PRSTCTL2_CLR_SCT0_SHIFT          (26U)
/*! SCT0 - SCT0 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL2_CLR_SCT0(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_CLR_SCT0_SHIFT)) & RSTCTL0_PRSTCTL2_CLR_SCT0_MASK)

#define RSTCTL0_PRSTCTL2_CLR_LP_FLEXCOMM0_MASK   (0x40000000U)
#define RSTCTL0_PRSTCTL2_CLR_LP_FLEXCOMM0_SHIFT  (30U)
/*! LP_FLEXCOMM0 - LP_FLEXCOMM0 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL2_CLR_LP_FLEXCOMM0(x)     (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_CLR_LP_FLEXCOMM0_SHIFT)) & RSTCTL0_PRSTCTL2_CLR_LP_FLEXCOMM0_MASK)

#define RSTCTL0_PRSTCTL2_CLR_LP_FLEXCOMM1_MASK   (0x80000000U)
#define RSTCTL0_PRSTCTL2_CLR_LP_FLEXCOMM1_SHIFT  (31U)
/*! LP_FLEXCOMM1 - LP_FLEXCOMM1 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL2_CLR_LP_FLEXCOMM1(x)     (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL2_CLR_LP_FLEXCOMM1_SHIFT)) & RSTCTL0_PRSTCTL2_CLR_LP_FLEXCOMM1_MASK)
/*! @} */

/*! @name PRSTCTL3_CLR - Compute Domain Peripheral Reset Control 3 CLR */
/*! @{ */

#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM2_MASK   (0x1U)
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM2_SHIFT  (0U)
/*! LP_FLEXCOMM2 - LP_FLEXCOMM2 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM2(x)     (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM2_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM2_MASK)

#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM3_MASK   (0x2U)
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM3_SHIFT  (1U)
/*! LP_FLEXCOMM3 - LP_FLEXCOMM3 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM3(x)     (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM3_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM3_MASK)

#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM4_MASK   (0x4U)
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM4_SHIFT  (2U)
/*! LP_FLEXCOMM4 - LP_FLEXCOMM4 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM4(x)     (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM4_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM4_MASK)

#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM5_MASK   (0x8U)
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM5_SHIFT  (3U)
/*! LP_FLEXCOMM5 - LP_FLEXCOMM5 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM5(x)     (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM5_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM5_MASK)

#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM6_MASK   (0x10U)
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM6_SHIFT  (4U)
/*! LP_FLEXCOMM6 - LP_FLEXCOMM6 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM6(x)     (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM6_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM6_MASK)

