Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_RSTCTL0.h
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM7_MASK   (0x20U)
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM7_SHIFT  (5U)
/*! LP_FLEXCOMM7 - LP_FLEXCOMM7 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM7(x)     (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM7_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM7_MASK)

#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM8_MASK   (0x40U)
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM8_SHIFT  (6U)
/*! LP_FLEXCOMM8 - LP_FLEXCOMM8 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM8(x)     (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM8_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM8_MASK)

#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM9_MASK   (0x80U)
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM9_SHIFT  (7U)
/*! LP_FLEXCOMM9 - LP_FLEXCOMM9 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM9(x)     (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM9_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM9_MASK)

#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM10_MASK  (0x100U)
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM10_SHIFT (8U)
/*! LP_FLEXCOMM10 - LP_FLEXCOMM10 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM10(x)    (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM10_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM10_MASK)

#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM11_MASK  (0x200U)
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM11_SHIFT (9U)
/*! LP_FLEXCOMM11 - LP_FLEXCOMM11 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM11(x)    (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM11_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM11_MASK)

#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM12_MASK  (0x400U)
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM12_SHIFT (10U)
/*! LP_FLEXCOMM12 - LP_FLEXCOMM12 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM12(x)    (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM12_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM12_MASK)

#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM13_MASK  (0x800U)
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM13_SHIFT (11U)
/*! LP_FLEXCOMM13 - LP_FLEXCOMM13 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM13(x)    (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM13_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_LP_FLEXCOMM13_MASK)

#define RSTCTL0_PRSTCTL3_CLR_SAI0_MASK           (0x2000U)
#define RSTCTL0_PRSTCTL3_CLR_SAI0_SHIFT          (13U)
/*! SAI0 - SAI0 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_SAI0(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_SAI0_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_SAI0_MASK)

#define RSTCTL0_PRSTCTL3_CLR_SAI1_MASK           (0x4000U)
#define RSTCTL0_PRSTCTL3_CLR_SAI1_SHIFT          (14U)
/*! SAI1 - SAI1 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_SAI1(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_SAI1_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_SAI1_MASK)

#define RSTCTL0_PRSTCTL3_CLR_SAI2_MASK           (0x8000U)
#define RSTCTL0_PRSTCTL3_CLR_SAI2_SHIFT          (15U)
/*! SAI2 - SAI2 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_SAI2(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_SAI2_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_SAI2_MASK)

#define RSTCTL0_PRSTCTL3_CLR_I3C0_MASK           (0x10000U)
#define RSTCTL0_PRSTCTL3_CLR_I3C0_SHIFT          (16U)
/*! I3C0 - I3C0 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_I3C0(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_I3C0_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_I3C0_MASK)

#define RSTCTL0_PRSTCTL3_CLR_I3C1_MASK           (0x20000U)
#define RSTCTL0_PRSTCTL3_CLR_I3C1_SHIFT          (17U)
/*! I3C1 - I3C1 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_I3C1(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_I3C1_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_I3C1_MASK)

#define RSTCTL0_PRSTCTL3_CLR_CRC0_MASK           (0x40000U)
#define RSTCTL0_PRSTCTL3_CLR_CRC0_SHIFT          (18U)
/*! CRC0 - CRC0 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_CRC0(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_CRC0_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_CRC0_MASK)

#define RSTCTL0_PRSTCTL3_CLR_CTIMER0_MASK        (0x200000U)
#define RSTCTL0_PRSTCTL3_CLR_CTIMER0_SHIFT       (21U)
/*! CTIMER0 - CTIMER0 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_CTIMER0(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_CTIMER0_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_CTIMER0_MASK)

#define RSTCTL0_PRSTCTL3_CLR_CTIMER1_MASK        (0x400000U)
#define RSTCTL0_PRSTCTL3_CLR_CTIMER1_SHIFT       (22U)
/*! CTIMER1 - CTIMER1 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_CTIMER1(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_CTIMER1_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_CTIMER1_MASK)

#define RSTCTL0_PRSTCTL3_CLR_CTIMER2_MASK        (0x800000U)
#define RSTCTL0_PRSTCTL3_CLR_CTIMER2_SHIFT       (23U)
/*! CTIMER2 - CTIMER2 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_CTIMER2(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_CTIMER2_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_CTIMER2_MASK)

#define RSTCTL0_PRSTCTL3_CLR_CTIMER3_MASK        (0x1000000U)
#define RSTCTL0_PRSTCTL3_CLR_CTIMER3_SHIFT       (24U)
/*! CTIMER3 - CTIMER3 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_CTIMER3(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_CTIMER3_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_CTIMER3_MASK)

#define RSTCTL0_PRSTCTL3_CLR_CTIMER4_MASK        (0x2000000U)
#define RSTCTL0_PRSTCTL3_CLR_CTIMER4_SHIFT       (25U)
/*! CTIMER4 - CTIMER4 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_CTIMER4(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_CTIMER4_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_CTIMER4_MASK)

#define RSTCTL0_PRSTCTL3_CLR_MRT0_MASK           (0x4000000U)
#define RSTCTL0_PRSTCTL3_CLR_MRT0_SHIFT          (26U)
/*! MRT0 - MRT0 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_MRT0(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_MRT0_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_MRT0_MASK)

#define RSTCTL0_PRSTCTL3_CLR_UTICK0_MASK         (0x8000000U)
#define RSTCTL0_PRSTCTL3_CLR_UTICK0_SHIFT        (27U)
/*! UTICK0 - UTICK0 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_UTICK0(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_UTICK0_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_UTICK0_MASK)

#define RSTCTL0_PRSTCTL3_CLR_SEMA42_4_MASK       (0x40000000U)
#define RSTCTL0_PRSTCTL3_CLR_SEMA42_4_SHIFT      (30U)
/*! SEMA42_4 - SEMA42_4 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_SEMA42_4(x)         (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_SEMA42_4_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_SEMA42_4_MASK)

#define RSTCTL0_PRSTCTL3_CLR_MU4_MASK            (0x80000000U)
#define RSTCTL0_PRSTCTL3_CLR_MU4_SHIFT           (31U)
/*! MU4 - MU4 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL3_CLR_MU4(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL3_CLR_MU4_SHIFT)) & RSTCTL0_PRSTCTL3_CLR_MU4_MASK)
/*! @} */

