Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_RSTCTL0.h
/*! @name PRSTCTL4_CLR - Compute Domain Peripheral Reset Control 4 CLR */
/*! @{ */

#define RSTCTL0_PRSTCTL4_CLR_CMX_PERFMON2_MASK   (0x1U)
#define RSTCTL0_PRSTCTL4_CLR_CMX_PERFMON2_SHIFT  (0U)
/*! CMX_PERFMON2 - CMX_PERFMON2 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL4_CLR_CMX_PERFMON2(x)     (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL4_CLR_CMX_PERFMON2_SHIFT)) & RSTCTL0_PRSTCTL4_CLR_CMX_PERFMON2_MASK)

#define RSTCTL0_PRSTCTL4_CLR_CMX_PERFMON3_MASK   (0x2U)
#define RSTCTL0_PRSTCTL4_CLR_CMX_PERFMON3_SHIFT  (1U)
/*! CMX_PERFMON3 - CMX_PERFMON3 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL4_CLR_CMX_PERFMON3(x)     (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL4_CLR_CMX_PERFMON3_SHIFT)) & RSTCTL0_PRSTCTL4_CLR_CMX_PERFMON3_MASK)

#define RSTCTL0_PRSTCTL4_CLR_SAFO_SGI_MASK       (0x4U)
#define RSTCTL0_PRSTCTL4_CLR_SAFO_SGI_SHIFT      (2U)
/*! SAFO_SGI - SAFO_SGI Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL4_CLR_SAFO_SGI(x)         (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL4_CLR_SAFO_SGI_SHIFT)) & RSTCTL0_PRSTCTL4_CLR_SAFO_SGI_MASK)

#define RSTCTL0_PRSTCTL4_CLR_PINT0_MASK          (0x20U)
#define RSTCTL0_PRSTCTL4_CLR_PINT0_SHIFT         (5U)
/*! PINT0 - PINT0 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL4_CLR_PINT0(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL4_CLR_PINT0_SHIFT)) & RSTCTL0_PRSTCTL4_CLR_PINT0_MASK)

#define RSTCTL0_PRSTCTL4_CLR_INPUTMUX0_MASK      (0x80U)
#define RSTCTL0_PRSTCTL4_CLR_INPUTMUX0_SHIFT     (7U)
/*! INPUTMUX0 - INPUTMUX0 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL4_CLR_INPUTMUX0(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL4_CLR_INPUTMUX0_SHIFT)) & RSTCTL0_PRSTCTL4_CLR_INPUTMUX0_MASK)

#define RSTCTL0_PRSTCTL4_CLR_FREQME0_MASK        (0x100U)
#define RSTCTL0_PRSTCTL4_CLR_FREQME0_SHIFT       (8U)
/*! FREQME0 - FREQME0 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL4_CLR_FREQME0(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL4_CLR_FREQME0_SHIFT)) & RSTCTL0_PRSTCTL4_CLR_FREQME0_MASK)

#define RSTCTL0_PRSTCTL4_CLR_CMX_PERFMON0_MASK   (0x400U)
#define RSTCTL0_PRSTCTL4_CLR_CMX_PERFMON0_SHIFT  (10U)
/*! CMX_PERFMON0 - CMX_PERFMON0 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL4_CLR_CMX_PERFMON0(x)     (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL4_CLR_CMX_PERFMON0_SHIFT)) & RSTCTL0_PRSTCTL4_CLR_CMX_PERFMON0_MASK)

#define RSTCTL0_PRSTCTL4_CLR_CMX_PERFMON1_MASK   (0x800U)
#define RSTCTL0_PRSTCTL4_CLR_CMX_PERFMON1_SHIFT  (11U)
/*! CMX_PERFMON1 - CMX_PERFMON1 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL4_CLR_CMX_PERFMON1(x)     (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL4_CLR_CMX_PERFMON1_SHIFT)) & RSTCTL0_PRSTCTL4_CLR_CMX_PERFMON1_MASK)

#define RSTCTL0_PRSTCTL4_CLR_NPU0_MASK           (0x1000U)
#define RSTCTL0_PRSTCTL4_CLR_NPU0_SHIFT          (12U)
/*! NPU0 - NPU0 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL4_CLR_NPU0(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL4_CLR_NPU0_SHIFT)) & RSTCTL0_PRSTCTL4_CLR_NPU0_MASK)
/*! @} */

/*! @name PRSTCTL5_CLR - DSP Domain Peripheral Reset Control 5 CLR */
/*! @{ */

#define RSTCTL0_PRSTCTL5_CLR_HIFI4_MASK          (0x1U)
#define RSTCTL0_PRSTCTL5_CLR_HIFI4_SHIFT         (0U)
/*! HiFi4 - HiFi4 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL5_CLR_HIFI4(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL5_CLR_HIFI4_SHIFT)) & RSTCTL0_PRSTCTL5_CLR_HIFI4_MASK)

#define RSTCTL0_PRSTCTL5_CLR_VDD2_DSP_DEBUG_MASK (0x4U)
#define RSTCTL0_PRSTCTL5_CLR_VDD2_DSP_DEBUG_SHIFT (2U)
/*! VDD2_DSP_DEBUG - HiFi4 Debug Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL0_PRSTCTL5_CLR_VDD2_DSP_DEBUG(x)   (((uint32_t)(((uint32_t)(x)) << RSTCTL0_PRSTCTL5_CLR_VDD2_DSP_DEBUG_SHIFT)) & RSTCTL0_PRSTCTL5_CLR_VDD2_DSP_DEBUG_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group RSTCTL0_Register_Masks */


/*!
 * @}
 */ /* end of group RSTCTL0_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#elif defined(__XTENSA__)
  /* leave anonymous unions enabled */
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_RSTCTL0_H_ */

